espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/io_mux_eco5_reg.h
/*
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#pragma once

#include <stdint.h>
#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

// definitions below are generated from pin_txt.csv
#define PERIPHS_IO_MUX_U_PAD_GPIO0                   (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO0_GPIO0_0                                                 0
#define FUNC_GPIO0_GPIO0                                                   1

#define PERIPHS_IO_MUX_U_PAD_GPIO1                   (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO1_GPIO1_0                                                 0
#define FUNC_GPIO1_GPIO1                                                   1

#define PERIPHS_IO_MUX_U_PAD_GPIO2                   (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO2_MTCK                                                    0
#define FUNC_GPIO2_GPIO2                                                   1

#define PERIPHS_IO_MUX_U_PAD_GPIO3                   (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO3_MTDI                                                    0
#define FUNC_GPIO3_GPIO3                                                   1

#define PERIPHS_IO_MUX_U_PAD_GPIO4                   (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO4_MTMS                                                    0
#define FUNC_GPIO4_GPIO4                                                   1

#define PERIPHS_IO_MUX_U_PAD_GPIO5                   (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO5_MTDO                                                    0
#define FUNC_GPIO5_GPIO5                                                   1

#define PERIPHS_IO_MUX_U_PAD_GPIO6                   (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO6_GPIO6_0                                                 0
#define FUNC_GPIO6_GPIO6                                                   1
#define FUNC_GPIO6_SPI2_HOLD_PAD                                           3

#define PERIPHS_IO_MUX_U_PAD_GPIO7                   (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO7_GPIO7_0                                                 0
#define FUNC_GPIO7_GPIO7                                                   1
#define FUNC_GPIO7_SPI2_CS_PAD                                             3

#define PERIPHS_IO_MUX_U_PAD_GPIO8                   (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO8_GPIO8_0                                                 0
#define FUNC_GPIO8_GPIO8                                                   1
#define FUNC_GPIO8_UART0_RTS_PAD                                           2
#define FUNC_GPIO8_SPI2_D_PAD                                              3

#define PERIPHS_IO_MUX_U_PAD_GPIO9                   (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO9_GPIO9_0                                                 0
#define FUNC_GPIO9_GPIO9                                                   1
#define FUNC_GPIO9_UART0_CTS_PAD                                           2
#define FUNC_GPIO9_SPI2_CK_PAD                                             3

#define PERIPHS_IO_MUX_U_PAD_GPIO10                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO10_GPIO10_0                                               0
#define FUNC_GPIO10_GPIO10                                                 1
#define FUNC_GPIO10_UART1_TXD_PAD                                          2
#define FUNC_GPIO10_SPI2_Q_PAD                                             3

#define PERIPHS_IO_MUX_U_PAD_GPIO11                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO11_GPIO11_0                                               0
#define FUNC_GPIO11_GPIO11                                                 1
#define FUNC_GPIO11_UART1_RXD_PAD                                          2
#define FUNC_GPIO11_SPI2_WP_PAD                                            3

#define PERIPHS_IO_MUX_U_PAD_GPIO12                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO12_GPIO12_0                                               0
#define FUNC_GPIO12_GPIO12                                                 1
#define FUNC_GPIO12_UART1_RTS_PAD                                          2

#define PERIPHS_IO_MUX_U_PAD_GPIO13                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO13_GPIO13_0                                               0
#define FUNC_GPIO13_GPIO13                                                 1
#define FUNC_GPIO13_UART1_CTS_PAD                                          2

#define PERIPHS_IO_MUX_U_PAD_GPIO14                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO14_GPIO14_0                                               0
#define FUNC_GPIO14_GPIO14                                                 1

#define PERIPHS_IO_MUX_U_PAD_GPIO15                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO15_GPIO15_0                                               0
#define FUNC_GPIO15_GPIO15                                                 1

#define PERIPHS_IO_MUX_U_PAD_GPIO16                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO16_GPIO16_0                                               0
#define FUNC_GPIO16_GPIO16                                                 1

#define PERIPHS_IO_MUX_U_PAD_GPIO17                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO17_GPIO17_0                                               0
#define FUNC_GPIO17_GPIO17                                                 1

#define PERIPHS_IO_MUX_U_PAD_GPIO18                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO18_GPIO18_0                                               0
#define FUNC_GPIO18_GPIO18                                                 1

#define PERIPHS_IO_MUX_U_PAD_GPIO19                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO19_GPIO19_0                                               0
#define FUNC_GPIO19_GPIO19                                                 1

#define PERIPHS_IO_MUX_U_PAD_GPIO20                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO20_GPIO20_0                                               0
#define FUNC_GPIO20_GPIO20                                                 1

#define PERIPHS_IO_MUX_U_PAD_GPIO21                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO21_GPIO21_0                                               0
#define FUNC_GPIO21_GPIO21                                                 1

