espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/io_mux_eco5_reg.h
#define PERIPHS_IO_MUX_U_PAD_GPIO22                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO22_GPIO22_0                                               0
#define FUNC_GPIO22_GPIO22                                                 1
#define FUNC_GPIO22_DBG_PSRAM_CK_PAD                                       4

#define PERIPHS_IO_MUX_U_PAD_GPIO23                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO23_GPIO23_0                                               0
#define FUNC_GPIO23_GPIO23                                                 1
#define FUNC_GPIO23_REF_50M_CLK_PAD                                        3
#define FUNC_GPIO23_DBG_PSRAM_CS_PAD                                       4

#define PERIPHS_IO_MUX_U_PAD_GPIO24                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO24_GPIO24_0                                               0
#define FUNC_GPIO24_GPIO24                                                 1

#define PERIPHS_IO_MUX_U_PAD_GPIO25                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO25_GPIO25_0                                               0
#define FUNC_GPIO25_GPIO25                                                 1

#define PERIPHS_IO_MUX_U_PAD_GPIO26                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO26_GPIO26_0                                               0
#define FUNC_GPIO26_GPIO26                                                 1

#define PERIPHS_IO_MUX_U_PAD_GPIO27                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO27_GPIO27_0                                               0
#define FUNC_GPIO27_GPIO27                                                 1

#define PERIPHS_IO_MUX_U_PAD_GPIO28                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO28_GPIO28_0                                               0
#define FUNC_GPIO28_GPIO28                                                 1
#define FUNC_GPIO28_SPI2_CS_PAD                                            2
#define FUNC_GPIO28_GMAC_PHY_RXDV_PAD                                      3
#define FUNC_GPIO28_DBG_PSRAM_D_PAD                                        4

#define PERIPHS_IO_MUX_U_PAD_GPIO29                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO29_GPIO29_0                                               0
#define FUNC_GPIO29_GPIO29                                                 1
#define FUNC_GPIO29_SPI2_D_PAD                                             2
#define FUNC_GPIO29_GMAC_PHY_RXD0_PAD                                      3
#define FUNC_GPIO29_DBG_PSRAM_Q_PAD                                        4

#define PERIPHS_IO_MUX_U_PAD_GPIO30                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO30_GPIO30_0                                               0
#define FUNC_GPIO30_GPIO30                                                 1
#define FUNC_GPIO30_SPI2_CK_PAD                                            2
#define FUNC_GPIO30_GMAC_PHY_RXD1_PAD                                      3
#define FUNC_GPIO30_DBG_PSRAM_WP_PAD                                       4

#define PERIPHS_IO_MUX_U_PAD_GPIO31                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO31_GPIO31_0                                               0
#define FUNC_GPIO31_GPIO31                                                 1
#define FUNC_GPIO31_SPI2_Q_PAD                                             2
#define FUNC_GPIO31_GMAC_PHY_RXER_PAD                                      3
#define FUNC_GPIO31_DBG_PSRAM_HOLD_PAD                                     4

// Strapping: Diag Group Sel1
#define PERIPHS_IO_MUX_U_PAD_GPIO32                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO32_GPIO32_0                                               0
#define FUNC_GPIO32_GPIO32                                                 1
#define FUNC_GPIO32_SPI2_HOLD_PAD                                          2
#define FUNC_GPIO32_GMAC_RMII_CLK_PAD                                      3
#define FUNC_GPIO32_DBG_PSRAM_DQ4_PAD                                      4

// Strapping: Diag Group Sel0
#define PERIPHS_IO_MUX_U_PAD_GPIO33                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO33_GPIO33_0                                               0
#define FUNC_GPIO33_GPIO33                                                 1
#define FUNC_GPIO33_SPI2_WP_PAD                                            2
#define FUNC_GPIO33_GMAC_PHY_TXEN_PAD                                      3
#define FUNC_GPIO33_DBG_PSRAM_DQ5_PAD                                      4

// Strapping: USB2JTAG select: 1->usb2jtag 0-> pad_jtag
#define PERIPHS_IO_MUX_U_PAD_GPIO34                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO34_GPIO34_0                                               0
#define FUNC_GPIO34_GPIO34                                                 1
#define FUNC_GPIO34_SPI2_IO4_PAD                                           2
#define FUNC_GPIO34_GMAC_PHY_TXD0_PAD                                      3
#define FUNC_GPIO34_DBG_PSRAM_DQ6_PAD                                      4

// Strapping: Boot Mode select 3
#define PERIPHS_IO_MUX_U_PAD_GPIO35                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO35_GPIO35_0                                               0
#define FUNC_GPIO35_GPIO35                                                 1
#define FUNC_GPIO35_SPI2_IO5_PAD                                           2
#define FUNC_GPIO35_GMAC_PHY_TXD1_PAD                                      3
#define FUNC_GPIO35_DBG_PSRAM_DQ7_PAD                                      4

// Strapping: Boot Mode select 2
#define PERIPHS_IO_MUX_U_PAD_GPIO36                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO36_GPIO36_0                                               0
#define FUNC_GPIO36_GPIO36                                                 1
#define FUNC_GPIO36_SPI2_IO6_PAD                                           2
#define FUNC_GPIO36_GMAC_PHY_TXER_PAD                                      3
#define FUNC_GPIO36_DBG_PSRAM_DQS_0_PAD                                    4

// Strapping: Boot Mode select 1
#define PERIPHS_IO_MUX_U_PAD_GPIO37                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO37_UART0_TXD_PAD                                          0
#define FUNC_GPIO37_GPIO37                                                 1
#define FUNC_GPIO37_SPI2_IO7_PAD                                           2

