espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/io_mux_eco5_reg.h
// Strapping: Boot Mode select 0
#define PERIPHS_IO_MUX_U_PAD_GPIO38                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO38_UART0_RXD_PAD                                          0
#define FUNC_GPIO38_GPIO38                                                 1
#define FUNC_GPIO38_SPI2_DQS_PAD                                           2

#define PERIPHS_IO_MUX_U_PAD_GPIO39                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO39_SD1_CDATA0_PAD                                         0
#define FUNC_GPIO39_GPIO39                                                 1
#define FUNC_GPIO39_BIST_PAD                                               2
#define FUNC_GPIO39_REF_50M_CLK_PAD                                        3
#define FUNC_GPIO39_DBG_PSRAM_DQ8_PAD                                      4

#define PERIPHS_IO_MUX_U_PAD_GPIO40                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO40_SD1_CDATA1_PAD                                         0
#define FUNC_GPIO40_GPIO40                                                 1
#define FUNC_GPIO40_BIST_PAD                                               2
#define FUNC_GPIO40_GMAC_PHY_TXEN_PAD                                      3
#define FUNC_GPIO40_DBG_PSRAM_DQ9_PAD                                      4

#define PERIPHS_IO_MUX_U_PAD_GPIO41                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO41_SD1_CDATA2_PAD                                         0
#define FUNC_GPIO41_GPIO41                                                 1
#define FUNC_GPIO41_BIST_PAD                                               2
#define FUNC_GPIO41_GMAC_PHY_TXD0_PAD                                      3
#define FUNC_GPIO41_DBG_PSRAM_DQ10_PAD                                     4

#define PERIPHS_IO_MUX_U_PAD_GPIO42                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO42_SD1_CDATA3_PAD                                         0
#define FUNC_GPIO42_GPIO42                                                 1
#define FUNC_GPIO42_BIST_PAD                                               2
#define FUNC_GPIO42_GMAC_PHY_TXD1_PAD                                      3
#define FUNC_GPIO42_DBG_PSRAM_DQ11_PAD                                     4

#define PERIPHS_IO_MUX_U_PAD_GPIO43                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO43_SD1_CCLK_PAD                                           0
#define FUNC_GPIO43_GPIO43                                                 1
#define FUNC_GPIO43_BIST_PAD                                               2
#define FUNC_GPIO43_GMAC_PHY_TXER_PAD                                      3
#define FUNC_GPIO43_DBG_PSRAM_DQ12_PAD                                     4

#define PERIPHS_IO_MUX_U_PAD_GPIO44                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO44_SD1_CCMD_PAD                                           0
#define FUNC_GPIO44_GPIO44                                                 1
#define FUNC_GPIO44_BIST_PAD                                               2
#define FUNC_GPIO44_GMAC_RMII_CLK_PAD                                      3
#define FUNC_GPIO44_DBG_PSRAM_DQ13_PAD                                     4

#define PERIPHS_IO_MUX_U_PAD_GPIO45                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO45_SD1_CDATA4_PAD                                         0
#define FUNC_GPIO45_GPIO45                                                 1
#define FUNC_GPIO45_BIST_PAD                                               2
#define FUNC_GPIO45_GMAC_PHY_RXDV_PAD                                      3
#define FUNC_GPIO45_DBG_PSRAM_DQ14_PAD                                     4

#define PERIPHS_IO_MUX_U_PAD_GPIO46                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO46_SD1_CDATA5_PAD                                         0
#define FUNC_GPIO46_GPIO46                                                 1
#define FUNC_GPIO46_BIST_PAD                                               2
#define FUNC_GPIO46_GMAC_PHY_RXD0_PAD                                      3
#define FUNC_GPIO46_DBG_PSRAM_DQ15_PAD                                     4

#define PERIPHS_IO_MUX_U_PAD_GPIO47                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO47_SD1_CDATA6_PAD                                         0
#define FUNC_GPIO47_GPIO47                                                 1
#define FUNC_GPIO47_BIST_PAD                                               2
#define FUNC_GPIO47_GMAC_PHY_RXD1_PAD                                      3
#define FUNC_GPIO47_DBG_PSRAM_DQS_1_PAD                                    4

#define PERIPHS_IO_MUX_U_PAD_GPIO48                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO48_SD1_CDATA7_PAD                                         0
#define FUNC_GPIO48_GPIO48                                                 1
#define FUNC_GPIO48_BIST_PAD                                               2
#define FUNC_GPIO48_GMAC_PHY_RXER_PAD                                      3

#define PERIPHS_IO_MUX_U_PAD_GPIO49                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO49_GPIO49_0                                               0
#define FUNC_GPIO49_GPIO49                                                 1
#define FUNC_GPIO49_GMAC_PHY_TXEN_PAD                                      3
#define FUNC_GPIO49_DBG_FLASH_CS_PAD                                       4

#define PERIPHS_IO_MUX_U_PAD_GPIO50                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO50_GPIO50_0                                               0
#define FUNC_GPIO50_GPIO50                                                 1
#define FUNC_GPIO50_GMAC_RMII_CLK_PAD                                      3
#define FUNC_GPIO50_DBG_FLASH_Q_PAD                                        4

#define PERIPHS_IO_MUX_U_PAD_GPIO51                  (REG_IO_MUX_BASE + 0x0)
#define FUNC_GPIO51_GPIO51_0                                               0
#define FUNC_GPIO51_GPIO51                                                 1
#define FUNC_GPIO51_GMAC_PHY_RXDV_PAD                                      3
#define FUNC_GPIO51_DBG_FLASH_WP_PAD                                       4

