espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/io_mux_eco5_reg.h
/** IO_MUX_gpio41_REG register
 *  iomux control register for gpio41
 */
#define IO_MUX_GPIO41_REG (DR_REG_IO_MUX_BASE + 0xa8)
/** IO_MUX_GPIO41_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  output enable on sleep mode
 */
#define IO_MUX_GPIO41_MCU_OE    (BIT(0))
#define IO_MUX_GPIO41_MCU_OE_M  (IO_MUX_GPIO41_MCU_OE_V << IO_MUX_GPIO41_MCU_OE_S)
#define IO_MUX_GPIO41_MCU_OE_V  0x00000001U
#define IO_MUX_GPIO41_MCU_OE_S  0
/** IO_MUX_GPIO41_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  io sleep mode enable. set 1 to enable sleep mode.
 */
#define IO_MUX_GPIO41_SLP_SEL    (BIT(1))
#define IO_MUX_GPIO41_SLP_SEL_M  (IO_MUX_GPIO41_SLP_SEL_V << IO_MUX_GPIO41_SLP_SEL_S)
#define IO_MUX_GPIO41_SLP_SEL_V  0x00000001U
#define IO_MUX_GPIO41_SLP_SEL_S  1
/** IO_MUX_GPIO41_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  pull-down enable on sleep mode
 */
#define IO_MUX_GPIO41_MCU_WPD    (BIT(2))
#define IO_MUX_GPIO41_MCU_WPD_M  (IO_MUX_GPIO41_MCU_WPD_V << IO_MUX_GPIO41_MCU_WPD_S)
#define IO_MUX_GPIO41_MCU_WPD_V  0x00000001U
#define IO_MUX_GPIO41_MCU_WPD_S  2
/** IO_MUX_GPIO41_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  pull-up enable on sleep mode
 */
#define IO_MUX_GPIO41_MCU_WPU    (BIT(3))
#define IO_MUX_GPIO41_MCU_WPU_M  (IO_MUX_GPIO41_MCU_WPU_V << IO_MUX_GPIO41_MCU_WPU_S)
#define IO_MUX_GPIO41_MCU_WPU_V  0x00000001U
#define IO_MUX_GPIO41_MCU_WPU_S  3
/** IO_MUX_GPIO41_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  input enable on sleep mode
 */
#define IO_MUX_GPIO41_MCU_IE    (BIT(4))
#define IO_MUX_GPIO41_MCU_IE_M  (IO_MUX_GPIO41_MCU_IE_V << IO_MUX_GPIO41_MCU_IE_S)
#define IO_MUX_GPIO41_MCU_IE_V  0x00000001U
#define IO_MUX_GPIO41_MCU_IE_S  4
/** IO_MUX_GPIO41_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  select drive strength on sleep mode
 */
#define IO_MUX_GPIO41_MCU_DRV    0x00000003U
#define IO_MUX_GPIO41_MCU_DRV_M  (IO_MUX_GPIO41_MCU_DRV_V << IO_MUX_GPIO41_MCU_DRV_S)
#define IO_MUX_GPIO41_MCU_DRV_V  0x00000003U
#define IO_MUX_GPIO41_MCU_DRV_S  5
/** IO_MUX_GPIO41_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  pull-down enable
 */
#define IO_MUX_GPIO41_FUN_WPD    (BIT(7))
#define IO_MUX_GPIO41_FUN_WPD_M  (IO_MUX_GPIO41_FUN_WPD_V << IO_MUX_GPIO41_FUN_WPD_S)
#define IO_MUX_GPIO41_FUN_WPD_V  0x00000001U
#define IO_MUX_GPIO41_FUN_WPD_S  7
/** IO_MUX_GPIO41_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  pull-up enable
 */
#define IO_MUX_GPIO41_FUN_WPU    (BIT(8))
#define IO_MUX_GPIO41_FUN_WPU_M  (IO_MUX_GPIO41_FUN_WPU_V << IO_MUX_GPIO41_FUN_WPU_S)
#define IO_MUX_GPIO41_FUN_WPU_V  0x00000001U
#define IO_MUX_GPIO41_FUN_WPU_S  8
/** IO_MUX_GPIO41_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  input enable
 */
#define IO_MUX_GPIO41_FUN_IE    (BIT(9))
#define IO_MUX_GPIO41_FUN_IE_M  (IO_MUX_GPIO41_FUN_IE_V << IO_MUX_GPIO41_FUN_IE_S)
#define IO_MUX_GPIO41_FUN_IE_V  0x00000001U
#define IO_MUX_GPIO41_FUN_IE_S  9
/** IO_MUX_GPIO41_FUN_DRV : R/W; bitpos: [11:10]; default: 2;
 *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
 */
#define IO_MUX_GPIO41_FUN_DRV    0x00000003U
#define IO_MUX_GPIO41_FUN_DRV_M  (IO_MUX_GPIO41_FUN_DRV_V << IO_MUX_GPIO41_FUN_DRV_S)
#define IO_MUX_GPIO41_FUN_DRV_V  0x00000003U
#define IO_MUX_GPIO41_FUN_DRV_S  10
/** IO_MUX_GPIO41_MCU_SEL : R/W; bitpos: [14:12]; default: 1;
 *  0:select function0, 1:select function1 ...
 */
#define IO_MUX_GPIO41_MCU_SEL    0x00000007U
#define IO_MUX_GPIO41_MCU_SEL_M  (IO_MUX_GPIO41_MCU_SEL_V << IO_MUX_GPIO41_MCU_SEL_S)
#define IO_MUX_GPIO41_MCU_SEL_V  0x00000007U
#define IO_MUX_GPIO41_MCU_SEL_S  12
/** IO_MUX_GPIO41_FILTER_EN : R/W; bitpos: [15]; default: 0;
 *  input filter enable
 */
#define IO_MUX_GPIO41_FILTER_EN    (BIT(15))
#define IO_MUX_GPIO41_FILTER_EN_M  (IO_MUX_GPIO41_FILTER_EN_V << IO_MUX_GPIO41_FILTER_EN_S)
#define IO_MUX_GPIO41_FILTER_EN_V  0x00000001U
#define IO_MUX_GPIO41_FILTER_EN_S  15

/** IO_MUX_gpio42_REG register
 *  iomux control register for gpio42
 */
#define IO_MUX_GPIO42_REG (DR_REG_IO_MUX_BASE + 0xac)
/** IO_MUX_GPIO42_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  output enable on sleep mode
 */
#define IO_MUX_GPIO42_MCU_OE    (BIT(0))
#define IO_MUX_GPIO42_MCU_OE_M  (IO_MUX_GPIO42_MCU_OE_V << IO_MUX_GPIO42_MCU_OE_S)
#define IO_MUX_GPIO42_MCU_OE_V  0x00000001U
#define IO_MUX_GPIO42_MCU_OE_S  0
/** IO_MUX_GPIO42_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  io sleep mode enable. set 1 to enable sleep mode.
 */
#define IO_MUX_GPIO42_SLP_SEL    (BIT(1))
#define IO_MUX_GPIO42_SLP_SEL_M  (IO_MUX_GPIO42_SLP_SEL_V << IO_MUX_GPIO42_SLP_SEL_S)
#define IO_MUX_GPIO42_SLP_SEL_V  0x00000001U
#define IO_MUX_GPIO42_SLP_SEL_S  1
/** IO_MUX_GPIO42_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  pull-down enable on sleep mode
 */
#define IO_MUX_GPIO42_MCU_WPD    (BIT(2))
#define IO_MUX_GPIO42_MCU_WPD_M  (IO_MUX_GPIO42_MCU_WPD_V << IO_MUX_GPIO42_MCU_WPD_S)
#define IO_MUX_GPIO42_MCU_WPD_V  0x00000001U
#define IO_MUX_GPIO42_MCU_WPD_S  2
/** IO_MUX_GPIO42_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  pull-up enable on sleep mode
 */
#define IO_MUX_GPIO42_MCU_WPU    (BIT(3))
#define IO_MUX_GPIO42_MCU_WPU_M  (IO_MUX_GPIO42_MCU_WPU_V << IO_MUX_GPIO42_MCU_WPU_S)
#define IO_MUX_GPIO42_MCU_WPU_V  0x00000001U
#define IO_MUX_GPIO42_MCU_WPU_S  3
/** IO_MUX_GPIO42_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  input enable on sleep mode
 */
#define IO_MUX_GPIO42_MCU_IE    (BIT(4))
#define IO_MUX_GPIO42_MCU_IE_M  (IO_MUX_GPIO42_MCU_IE_V << IO_MUX_GPIO42_MCU_IE_S)
#define IO_MUX_GPIO42_MCU_IE_V  0x00000001U
#define IO_MUX_GPIO42_MCU_IE_S  4
/** IO_MUX_GPIO42_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  select drive strength on sleep mode
 */
#define IO_MUX_GPIO42_MCU_DRV    0x00000003U
#define IO_MUX_GPIO42_MCU_DRV_M  (IO_MUX_GPIO42_MCU_DRV_V << IO_MUX_GPIO42_MCU_DRV_S)
#define IO_MUX_GPIO42_MCU_DRV_V  0x00000003U
#define IO_MUX_GPIO42_MCU_DRV_S  5
/** IO_MUX_GPIO42_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  pull-down enable
 */
#define IO_MUX_GPIO42_FUN_WPD    (BIT(7))
#define IO_MUX_GPIO42_FUN_WPD_M  (IO_MUX_GPIO42_FUN_WPD_V << IO_MUX_GPIO42_FUN_WPD_S)
#define IO_MUX_GPIO42_FUN_WPD_V  0x00000001U
#define IO_MUX_GPIO42_FUN_WPD_S  7
/** IO_MUX_GPIO42_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  pull-up enable
 */
#define IO_MUX_GPIO42_FUN_WPU    (BIT(8))
#define IO_MUX_GPIO42_FUN_WPU_M  (IO_MUX_GPIO42_FUN_WPU_V << IO_MUX_GPIO42_FUN_WPU_S)
#define IO_MUX_GPIO42_FUN_WPU_V  0x00000001U
#define IO_MUX_GPIO42_FUN_WPU_S  8
/** IO_MUX_GPIO42_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  input enable
 */
#define IO_MUX_GPIO42_FUN_IE    (BIT(9))
#define IO_MUX_GPIO42_FUN_IE_M  (IO_MUX_GPIO42_FUN_IE_V << IO_MUX_GPIO42_FUN_IE_S)
#define IO_MUX_GPIO42_FUN_IE_V  0x00000001U
#define IO_MUX_GPIO42_FUN_IE_S  9
/** IO_MUX_GPIO42_FUN_DRV : R/W; bitpos: [11:10]; default: 2;
 *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
 */
#define IO_MUX_GPIO42_FUN_DRV    0x00000003U
#define IO_MUX_GPIO42_FUN_DRV_M  (IO_MUX_GPIO42_FUN_DRV_V << IO_MUX_GPIO42_FUN_DRV_S)
#define IO_MUX_GPIO42_FUN_DRV_V  0x00000003U
#define IO_MUX_GPIO42_FUN_DRV_S  10
/** IO_MUX_GPIO42_MCU_SEL : R/W; bitpos: [14:12]; default: 1;
 *  0:select function0, 1:select function1 ...
 */
#define IO_MUX_GPIO42_MCU_SEL    0x00000007U
#define IO_MUX_GPIO42_MCU_SEL_M  (IO_MUX_GPIO42_MCU_SEL_V << IO_MUX_GPIO42_MCU_SEL_S)
#define IO_MUX_GPIO42_MCU_SEL_V  0x00000007U
#define IO_MUX_GPIO42_MCU_SEL_S  12
/** IO_MUX_GPIO42_FILTER_EN : R/W; bitpos: [15]; default: 0;
 *  input filter enable
 */
#define IO_MUX_GPIO42_FILTER_EN    (BIT(15))
#define IO_MUX_GPIO42_FILTER_EN_M  (IO_MUX_GPIO42_FILTER_EN_V << IO_MUX_GPIO42_FILTER_EN_S)
#define IO_MUX_GPIO42_FILTER_EN_V  0x00000001U
#define IO_MUX_GPIO42_FILTER_EN_S  15

/** IO_MUX_gpio43_REG register
 *  iomux control register for gpio43
 */
#define IO_MUX_GPIO43_REG (DR_REG_IO_MUX_BASE + 0xb0)
/** IO_MUX_GPIO43_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  output enable on sleep mode
 */
#define IO_MUX_GPIO43_MCU_OE    (BIT(0))
#define IO_MUX_GPIO43_MCU_OE_M  (IO_MUX_GPIO43_MCU_OE_V << IO_MUX_GPIO43_MCU_OE_S)
#define IO_MUX_GPIO43_MCU_OE_V  0x00000001U
#define IO_MUX_GPIO43_MCU_OE_S  0
/** IO_MUX_GPIO43_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  io sleep mode enable. set 1 to enable sleep mode.
 */
#define IO_MUX_GPIO43_SLP_SEL    (BIT(1))
#define IO_MUX_GPIO43_SLP_SEL_M  (IO_MUX_GPIO43_SLP_SEL_V << IO_MUX_GPIO43_SLP_SEL_S)
#define IO_MUX_GPIO43_SLP_SEL_V  0x00000001U
#define IO_MUX_GPIO43_SLP_SEL_S  1
/** IO_MUX_GPIO43_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  pull-down enable on sleep mode
 */
#define IO_MUX_GPIO43_MCU_WPD    (BIT(2))
#define IO_MUX_GPIO43_MCU_WPD_M  (IO_MUX_GPIO43_MCU_WPD_V << IO_MUX_GPIO43_MCU_WPD_S)
#define IO_MUX_GPIO43_MCU_WPD_V  0x00000001U
#define IO_MUX_GPIO43_MCU_WPD_S  2
/** IO_MUX_GPIO43_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  pull-up enable on sleep mode
 */
#define IO_MUX_GPIO43_MCU_WPU    (BIT(3))
#define IO_MUX_GPIO43_MCU_WPU_M  (IO_MUX_GPIO43_MCU_WPU_V << IO_MUX_GPIO43_MCU_WPU_S)
#define IO_MUX_GPIO43_MCU_WPU_V  0x00000001U
#define IO_MUX_GPIO43_MCU_WPU_S  3
/** IO_MUX_GPIO43_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  input enable on sleep mode
 */
#define IO_MUX_GPIO43_MCU_IE    (BIT(4))
#define IO_MUX_GPIO43_MCU_IE_M  (IO_MUX_GPIO43_MCU_IE_V << IO_MUX_GPIO43_MCU_IE_S)
#define IO_MUX_GPIO43_MCU_IE_V  0x00000001U
#define IO_MUX_GPIO43_MCU_IE_S  4
/** IO_MUX_GPIO43_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  select drive strength on sleep mode
 */
#define IO_MUX_GPIO43_MCU_DRV    0x00000003U
#define IO_MUX_GPIO43_MCU_DRV_M  (IO_MUX_GPIO43_MCU_DRV_V << IO_MUX_GPIO43_MCU_DRV_S)
#define IO_MUX_GPIO43_MCU_DRV_V  0x00000003U
#define IO_MUX_GPIO43_MCU_DRV_S  5
/** IO_MUX_GPIO43_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  pull-down enable
 */
#define IO_MUX_GPIO43_FUN_WPD    (BIT(7))
#define IO_MUX_GPIO43_FUN_WPD_M  (IO_MUX_GPIO43_FUN_WPD_V << IO_MUX_GPIO43_FUN_WPD_S)
#define IO_MUX_GPIO43_FUN_WPD_V  0x00000001U
#define IO_MUX_GPIO43_FUN_WPD_S  7
/** IO_MUX_GPIO43_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  pull-up enable
 */
#define IO_MUX_GPIO43_FUN_WPU    (BIT(8))
#define IO_MUX_GPIO43_FUN_WPU_M  (IO_MUX_GPIO43_FUN_WPU_V << IO_MUX_GPIO43_FUN_WPU_S)
#define IO_MUX_GPIO43_FUN_WPU_V  0x00000001U
#define IO_MUX_GPIO43_FUN_WPU_S  8
/** IO_MUX_GPIO43_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  input enable
 */
#define IO_MUX_GPIO43_FUN_IE    (BIT(9))
#define IO_MUX_GPIO43_FUN_IE_M  (IO_MUX_GPIO43_FUN_IE_V << IO_MUX_GPIO43_FUN_IE_S)
#define IO_MUX_GPIO43_FUN_IE_V  0x00000001U
#define IO_MUX_GPIO43_FUN_IE_S  9
/** IO_MUX_GPIO43_FUN_DRV : R/W; bitpos: [11:10]; default: 2;
 *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
 */
#define IO_MUX_GPIO43_FUN_DRV    0x00000003U
#define IO_MUX_GPIO43_FUN_DRV_M  (IO_MUX_GPIO43_FUN_DRV_V << IO_MUX_GPIO43_FUN_DRV_S)
#define IO_MUX_GPIO43_FUN_DRV_V  0x00000003U
#define IO_MUX_GPIO43_FUN_DRV_S  10
/** IO_MUX_GPIO43_MCU_SEL : R/W; bitpos: [14:12]; default: 1;
 *  0:select function0, 1:select function1 ...
 */
#define IO_MUX_GPIO43_MCU_SEL    0x00000007U
#define IO_MUX_GPIO43_MCU_SEL_M  (IO_MUX_GPIO43_MCU_SEL_V << IO_MUX_GPIO43_MCU_SEL_S)
#define IO_MUX_GPIO43_MCU_SEL_V  0x00000007U
#define IO_MUX_GPIO43_MCU_SEL_S  12
/** IO_MUX_GPIO43_FILTER_EN : R/W; bitpos: [15]; default: 0;
 *  input filter enable
 */
#define IO_MUX_GPIO43_FILTER_EN    (BIT(15))
#define IO_MUX_GPIO43_FILTER_EN_M  (IO_MUX_GPIO43_FILTER_EN_V << IO_MUX_GPIO43_FILTER_EN_S)
#define IO_MUX_GPIO43_FILTER_EN_V  0x00000001U
#define IO_MUX_GPIO43_FILTER_EN_S  15

/** IO_MUX_gpio44_REG register
 *  iomux control register for gpio44
 */
#define IO_MUX_GPIO44_REG (DR_REG_IO_MUX_BASE + 0xb4)
/** IO_MUX_GPIO44_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  output enable on sleep mode
 */
#define IO_MUX_GPIO44_MCU_OE    (BIT(0))
#define IO_MUX_GPIO44_MCU_OE_M  (IO_MUX_GPIO44_MCU_OE_V << IO_MUX_GPIO44_MCU_OE_S)
#define IO_MUX_GPIO44_MCU_OE_V  0x00000001U
#define IO_MUX_GPIO44_MCU_OE_S  0
/** IO_MUX_GPIO44_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  io sleep mode enable. set 1 to enable sleep mode.
 */
#define IO_MUX_GPIO44_SLP_SEL    (BIT(1))
#define IO_MUX_GPIO44_SLP_SEL_M  (IO_MUX_GPIO44_SLP_SEL_V << IO_MUX_GPIO44_SLP_SEL_S)
#define IO_MUX_GPIO44_SLP_SEL_V  0x00000001U
#define IO_MUX_GPIO44_SLP_SEL_S  1
/** IO_MUX_GPIO44_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  pull-down enable on sleep mode
 */
#define IO_MUX_GPIO44_MCU_WPD    (BIT(2))
#define IO_MUX_GPIO44_MCU_WPD_M  (IO_MUX_GPIO44_MCU_WPD_V << IO_MUX_GPIO44_MCU_WPD_S)
#define IO_MUX_GPIO44_MCU_WPD_V  0x00000001U
#define IO_MUX_GPIO44_MCU_WPD_S  2
/** IO_MUX_GPIO44_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  pull-up enable on sleep mode
 */
#define IO_MUX_GPIO44_MCU_WPU    (BIT(3))
#define IO_MUX_GPIO44_MCU_WPU_M  (IO_MUX_GPIO44_MCU_WPU_V << IO_MUX_GPIO44_MCU_WPU_S)
#define IO_MUX_GPIO44_MCU_WPU_V  0x00000001U
#define IO_MUX_GPIO44_MCU_WPU_S  3
/** IO_MUX_GPIO44_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  input enable on sleep mode
 */
#define IO_MUX_GPIO44_MCU_IE    (BIT(4))
#define IO_MUX_GPIO44_MCU_IE_M  (IO_MUX_GPIO44_MCU_IE_V << IO_MUX_GPIO44_MCU_IE_S)
#define IO_MUX_GPIO44_MCU_IE_V  0x00000001U
#define IO_MUX_GPIO44_MCU_IE_S  4
/** IO_MUX_GPIO44_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  select drive strength on sleep mode
 */
#define IO_MUX_GPIO44_MCU_DRV    0x00000003U
#define IO_MUX_GPIO44_MCU_DRV_M  (IO_MUX_GPIO44_MCU_DRV_V << IO_MUX_GPIO44_MCU_DRV_S)
#define IO_MUX_GPIO44_MCU_DRV_V  0x00000003U
#define IO_MUX_GPIO44_MCU_DRV_S  5
/** IO_MUX_GPIO44_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  pull-down enable
 */
#define IO_MUX_GPIO44_FUN_WPD    (BIT(7))
#define IO_MUX_GPIO44_FUN_WPD_M  (IO_MUX_GPIO44_FUN_WPD_V << IO_MUX_GPIO44_FUN_WPD_S)
#define IO_MUX_GPIO44_FUN_WPD_V  0x00000001U
#define IO_MUX_GPIO44_FUN_WPD_S  7
/** IO_MUX_GPIO44_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  pull-up enable
 */
#define IO_MUX_GPIO44_FUN_WPU    (BIT(8))
#define IO_MUX_GPIO44_FUN_WPU_M  (IO_MUX_GPIO44_FUN_WPU_V << IO_MUX_GPIO44_FUN_WPU_S)
#define IO_MUX_GPIO44_FUN_WPU_V  0x00000001U
#define IO_MUX_GPIO44_FUN_WPU_S  8
/** IO_MUX_GPIO44_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  input enable
 */
#define IO_MUX_GPIO44_FUN_IE    (BIT(9))
#define IO_MUX_GPIO44_FUN_IE_M  (IO_MUX_GPIO44_FUN_IE_V << IO_MUX_GPIO44_FUN_IE_S)
#define IO_MUX_GPIO44_FUN_IE_V  0x00000001U
#define IO_MUX_GPIO44_FUN_IE_S  9
/** IO_MUX_GPIO44_FUN_DRV : R/W; bitpos: [11:10]; default: 2;
 *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
 */
#define IO_MUX_GPIO44_FUN_DRV    0x00000003U
#define IO_MUX_GPIO44_FUN_DRV_M  (IO_MUX_GPIO44_FUN_DRV_V << IO_MUX_GPIO44_FUN_DRV_S)
#define IO_MUX_GPIO44_FUN_DRV_V  0x00000003U
#define IO_MUX_GPIO44_FUN_DRV_S  10
/** IO_MUX_GPIO44_MCU_SEL : R/W; bitpos: [14:12]; default: 1;
 *  0:select function0, 1:select function1 ...
 */
#define IO_MUX_GPIO44_MCU_SEL    0x00000007U
#define IO_MUX_GPIO44_MCU_SEL_M  (IO_MUX_GPIO44_MCU_SEL_V << IO_MUX_GPIO44_MCU_SEL_S)
#define IO_MUX_GPIO44_MCU_SEL_V  0x00000007U
#define IO_MUX_GPIO44_MCU_SEL_S  12
/** IO_MUX_GPIO44_FILTER_EN : R/W; bitpos: [15]; default: 0;
 *  input filter enable
 */
#define IO_MUX_GPIO44_FILTER_EN    (BIT(15))
#define IO_MUX_GPIO44_FILTER_EN_M  (IO_MUX_GPIO44_FILTER_EN_V << IO_MUX_GPIO44_FILTER_EN_S)
#define IO_MUX_GPIO44_FILTER_EN_V  0x00000001U
#define IO_MUX_GPIO44_FILTER_EN_S  15

/** IO_MUX_gpio45_REG register
 *  iomux control register for gpio45
 */
#define IO_MUX_GPIO45_REG (DR_REG_IO_MUX_BASE + 0xb8)
/** IO_MUX_GPIO45_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  output enable on sleep mode
 */
#define IO_MUX_GPIO45_MCU_OE    (BIT(0))
#define IO_MUX_GPIO45_MCU_OE_M  (IO_MUX_GPIO45_MCU_OE_V << IO_MUX_GPIO45_MCU_OE_S)
#define IO_MUX_GPIO45_MCU_OE_V  0x00000001U
#define IO_MUX_GPIO45_MCU_OE_S  0
/** IO_MUX_GPIO45_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  io sleep mode enable. set 1 to enable sleep mode.
 */
#define IO_MUX_GPIO45_SLP_SEL    (BIT(1))
#define IO_MUX_GPIO45_SLP_SEL_M  (IO_MUX_GPIO45_SLP_SEL_V << IO_MUX_GPIO45_SLP_SEL_S)
#define IO_MUX_GPIO45_SLP_SEL_V  0x00000001U
#define IO_MUX_GPIO45_SLP_SEL_S  1
/** IO_MUX_GPIO45_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  pull-down enable on sleep mode
 */
#define IO_MUX_GPIO45_MCU_WPD    (BIT(2))
#define IO_MUX_GPIO45_MCU_WPD_M  (IO_MUX_GPIO45_MCU_WPD_V << IO_MUX_GPIO45_MCU_WPD_S)
#define IO_MUX_GPIO45_MCU_WPD_V  0x00000001U
#define IO_MUX_GPIO45_MCU_WPD_S  2
/** IO_MUX_GPIO45_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  pull-up enable on sleep mode
 */
#define IO_MUX_GPIO45_MCU_WPU    (BIT(3))
#define IO_MUX_GPIO45_MCU_WPU_M  (IO_MUX_GPIO45_MCU_WPU_V << IO_MUX_GPIO45_MCU_WPU_S)
#define IO_MUX_GPIO45_MCU_WPU_V  0x00000001U
#define IO_MUX_GPIO45_MCU_WPU_S  3
/** IO_MUX_GPIO45_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  input enable on sleep mode
 */
#define IO_MUX_GPIO45_MCU_IE    (BIT(4))
#define IO_MUX_GPIO45_MCU_IE_M  (IO_MUX_GPIO45_MCU_IE_V << IO_MUX_GPIO45_MCU_IE_S)
#define IO_MUX_GPIO45_MCU_IE_V  0x00000001U
#define IO_MUX_GPIO45_MCU_IE_S  4
/** IO_MUX_GPIO45_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  select drive strength on sleep mode
 */
#define IO_MUX_GPIO45_MCU_DRV    0x00000003U
#define IO_MUX_GPIO45_MCU_DRV_M  (IO_MUX_GPIO45_MCU_DRV_V << IO_MUX_GPIO45_MCU_DRV_S)
#define IO_MUX_GPIO45_MCU_DRV_V  0x00000003U
#define IO_MUX_GPIO45_MCU_DRV_S  5
/** IO_MUX_GPIO45_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  pull-down enable
 */
#define IO_MUX_GPIO45_FUN_WPD    (BIT(7))
#define IO_MUX_GPIO45_FUN_WPD_M  (IO_MUX_GPIO45_FUN_WPD_V << IO_MUX_GPIO45_FUN_WPD_S)
#define IO_MUX_GPIO45_FUN_WPD_V  0x00000001U
#define IO_MUX_GPIO45_FUN_WPD_S  7
/** IO_MUX_GPIO45_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  pull-up enable
 */
#define IO_MUX_GPIO45_FUN_WPU    (BIT(8))
#define IO_MUX_GPIO45_FUN_WPU_M  (IO_MUX_GPIO45_FUN_WPU_V << IO_MUX_GPIO45_FUN_WPU_S)
#define IO_MUX_GPIO45_FUN_WPU_V  0x00000001U
#define IO_MUX_GPIO45_FUN_WPU_S  8
/** IO_MUX_GPIO45_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  input enable
 */
#define IO_MUX_GPIO45_FUN_IE    (BIT(9))
#define IO_MUX_GPIO45_FUN_IE_M  (IO_MUX_GPIO45_FUN_IE_V << IO_MUX_GPIO45_FUN_IE_S)
#define IO_MUX_GPIO45_FUN_IE_V  0x00000001U
#define IO_MUX_GPIO45_FUN_IE_S  9
/** IO_MUX_GPIO45_FUN_DRV : R/W; bitpos: [11:10]; default: 2;
 *  select drive strength, 0:5mA, 1:10mA, 2:20mA, 3:40mA
 */
#define IO_MUX_GPIO45_FUN_DRV    0x00000003U
#define IO_MUX_GPIO45_FUN_DRV_M  (IO_MUX_GPIO45_FUN_DRV_V << IO_MUX_GPIO45_FUN_DRV_S)
#define IO_MUX_GPIO45_FUN_DRV_V  0x00000003U
#define IO_MUX_GPIO45_FUN_DRV_S  10
/** IO_MUX_GPIO45_MCU_SEL : R/W; bitpos: [14:12]; default: 1;
 *  0:select function0, 1:select function1 ...
 */
#define IO_MUX_GPIO45_MCU_SEL    0x00000007U
#define IO_MUX_GPIO45_MCU_SEL_M  (IO_MUX_GPIO45_MCU_SEL_V << IO_MUX_GPIO45_MCU_SEL_S)
#define IO_MUX_GPIO45_MCU_SEL_V  0x00000007U
#define IO_MUX_GPIO45_MCU_SEL_S  12
/** IO_MUX_GPIO45_FILTER_EN : R/W; bitpos: [15]; default: 0;
 *  input filter enable
 */
#define IO_MUX_GPIO45_FILTER_EN    (BIT(15))
#define IO_MUX_GPIO45_FILTER_EN_M  (IO_MUX_GPIO45_FILTER_EN_V << IO_MUX_GPIO45_FILTER_EN_S)
#define IO_MUX_GPIO45_FILTER_EN_V  0x00000001U
#define IO_MUX_GPIO45_FILTER_EN_S  15

